case-1-airbox/RESULTS/BOBYQA/0.org/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (-30 0 0);  //initial speed of 30m/s
pressure             0.0;	//inlet pressure of 101325 Pa
turbulentKE          0.10;	//initial turbulent energy = 10%
turbulentOmega       1.78;
#inputMode           merge

// ************************************************************************* //
