case-1-airbox/RESULTS/BOBYQA/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         300;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
(
//     #include "readFields"
//     #include "streamLines"
//     #include "cuttingPlane"

surfaces1
{
    type            surfaces;
    functionObjectLibs ("libsampling.so");
    outputControl timeStep;
    outputInterval 300;
    region          region0;
    fields ( U p );
    interpolationScheme cellPointFace;
    surfaceFormat raw;
    surfaces
    (
        abInlet
        {
            type            patch;
            patches       ( airBox_abInlet );
           
        }    
    );
}
surfaces2
{
    type            surfaces;
    functionObjectLibs ("libsampling.so");
    outputControl timeStep;
    outputInterval 300;
    region          region0;
    fields ( U p );
    interpolationScheme cellPointFace;
    surfaceFormat raw;
    surfaces
    (
        abOutlet
        {
            type            patch;
            patches       (airBox_abOutlet);
           
        }     
    );
}
);


// ************************************************************************* //
